# Data Manipulation with Pandas

_DataCamp, October 2022_

## DataFrames

`pandas` is a python library for data manipulation. It is built on top of `numpy` and `matplotlib`, so you can expect a lot of ompatibility features with those two libraries as well.

A `DataFrame` is the class that pandas uses to represent tabular data, pretty much like a database table in SQL or a dataframe in R. Tabular data contains observations of the same kind as rows and each observation attribute as columns.

In [34]:
import pandas as pd

homelessness = pd.read_csv('homelessness.csv')

### Inspecting a DataFrame

Some important methods that pandas offers to inspect a dataframe to get familiar with it are:
.info() shows information on each of the columns, such as the data type and number of missing values.
.shape returns the number of rows and columns of the DataFrame.
.describe() calculates a few summary statistics for each column.

.head() returns the first few rows (the “head” of the DataFrame)

In [35]:
homelessness.head()

               region       state  individuals  family_members  state_pop
0  East South Central     Alabama       2570.0           864.0    4887681
1             Pacific      Alaska       1434.0           582.0     735139
2            Mountain     Arizona       7259.0          2606.0    7158024
3  West South Central    Arkansas       2280.0           432.0    3009733
4             Pacific  California     109008.0         20964.0   39461588

.info() shows information on each of the columns, such as the data type and number of missing values.

In [36]:
homelessness.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   region          51 non-null     object
 1   state           51 non-null     object
 2   individuals     51 non-null     float64
 3   family_members  51 non-null     float64
 4   state_pop       51 non-null     int64
dtypes: float64(2), int64(1), object(2)
memory usage: 2.1+ KB

.shape returns the number of rows and columns of the DataFrame

In [37]:
homelessness.shape

(51, 5)

.describe() calculates a few summary statistics for each column

In [38]:
homelessness.describe()

         individuals  family_members     state_pop
count      51.000000       51.000000  5.100000e+01
mean     7225.784314     3504.882353  6.405637e+06
std     15991.025083     7805.411811  7.327258e+06
min       434.000000       75.000000  5.776010e+05
25%      1446.500000      592.000000  1.777414e+06
50%      3082.000000     1482.000000  4.461153e+06
75%      6781.500000     3196.000000  7.340946e+06
max    109008.000000    52070.000000  3.946159e+07

### Parts of a DataFrame

A DataFrame contains 3 main attributes: `values`, which is a 2D NumPy array containing all the rows data, `columns`, an array with the column names, and `index`,  an array with the row labels

In [39]:
# Print the values of homelessness
homelessness.values

array([['East South Central', 'Alabama', 2570.0, 864.0, 4887681],
       ['Pacific', 'Alaska', 1434.0, 582.0, 735139],
       ['Mountain', 'Arizona', 7259.0, 2606.0, 7158024],
       ['West South Central', 'Arkansas', 2280.0, 432.0, 3009733],
       ['Pacific', 'California', 109008.0, 20964.0, 39461588],
       ['Mountain', 'Colorado', 7607.0, 3250.0, 5691287],
       ['New England', 'Connecticut', 2280.0, 1696.0, 3571520],
       ['South Atlantic', 'Delaware', 708.0, 374.0, 965479],
       ['South Atlantic', 'District of Columbia', 3770.0, 3134.0, 701547],
       ['South Atlantic', 'Florida', 21443.0, 9587.0, 21244317],
       ['South Atlantic', 'Georgia', 6943.0, 2556.0, 10511131],
       ['Pacific', 'Hawaii', 4131.0, 2399.0, 1420593],
       ['Mountain', 'Idaho', 1297.0, 715.0, 1750536],
       ['East North Central', 'Illinois', 6752.0, 3891.0, 12723071],
       ['East North Central', 'Indiana', 3776.0, 1482.0, 6695497],
       ['West North Central', 'Iowa', 1711.0, 1038.0, 3148618],
       ['West North Central', 'Kansas', 1443.0, 773.0, 2911359],
       ['East South Central', 'Kentucky', 2735.0, 953.0, 4461153],
       ['West South Central', 'Louisiana', 2540.0, 519.0, 4659690],
       ['New England', 'Maine', 1450.0, 1066.0, 1339057],
       ['South Atlantic', 'Maryland', 4914.0, 2230.0, 6035802],
       ['New England', 'Massachusetts', 6811.0, 13257.0, 6882635],
       ['East North Central', 'Michigan', 5209.0, 3142.0, 9984072],
       ['West North Central', 'Minnesota', 3993.0, 3250.0, 5606249],
       ['East South Central', 'Mississippi', 1024.0, 328.0, 2981020],
       ['West North Central', 'Missouri', 3776.0, 2107.0, 6121623],
       ['Mountain', 'Montana', 983.0, 422.0, 1060665],
       ['West North Central', 'Nebraska', 1745.0, 676.0, 1925614],
       ['Mountain', 'Nevada', 7058.0, 486.0, 3027341],
       ['New England', 'New Hampshire', 835.0, 615.0, 1353465],
       ['Mid-Atlantic', 'New Jersey', 6048.0, 3350.0, 8886025],
       ['Mountain', 'New Mexico', 1949.0, 602.0, 2092741],
       ['Mid-Atlantic', 'New York', 39827.0, 52070.0, 19530351],
       ['South Atlantic', 'North Carolina', 6451.0, 2817.0, 10381615],
       ['West North Central', 'North Dakota', 467.0, 75.0, 758080],
       ['East North Central', 'Ohio', 6929.0, 3320.0, 11676341],
       ['West South Central', 'Oklahoma', 2823.0, 1048.0, 3940235],
       ['Pacific', 'Oregon', 11139.0, 3337.0, 4181886],
       ['Mid-Atlantic', 'Pennsylvania', 8163.0, 5349.0, 12800922],
       ['New England', 'Rhode Island', 747.0, 354.0, 1058287],
       ['South Atlantic', 'South Carolina', 3082.0, 851.0, 5084156],
       ['West North Central', 'South Dakota', 836.0, 323.0, 878698],
       ['East South Central', 'Tennessee', 6139.0, 1744.0, 6771631],
       ['West South Central', 'Texas', 19199.0, 6111.0, 28628666],
       ['Mountain', 'Utah', 1904.0, 972.0, 3153550],
       ['New England', 'Vermont', 780.0, 511.0, 624358],
       ['South Atlantic', 'Virginia', 3928.0, 2047.0, 8501286],
       ['Pacific', 'Washington', 16424.0, 5880.0, 7523869],
       ['South Atlantic', 'West Virginia', 1021.0, 222.0, 1804291],
       ['East North Central', 'Wisconsin', 2740.0, 2167.0, 5807406],
       ['Mountain', 'Wyoming', 434.0, 205.0, 577601]], dtype=object)

In [40]:
# Print the column index of homelessness
homelessness.columns

Index(['region', 'state', 'individuals', 'family_members', 'state_pop'], dtype='object')

In [41]:
# Print the row index of homelessness
homelessness.index

RangeIndex(start=0, stop=51, step=1)

### Sorting
The method `sort_values` can be used to sort the DataFrame according to the given columns values

Sorting only by one column

In [42]:
sorted_homelessness = homelessness.sort_values("individuals")
sorted_homelessness.head()

                region         state  individuals  family_members  state_pop
50            Mountain       Wyoming        434.0           205.0     577601
34  West North Central  North Dakota        467.0            75.0     758080
7       South Atlantic      Delaware        708.0           374.0     965479
39         New England  Rhode Island        747.0           354.0    1058287
45         New England       Vermont        780.0           511.0     624358

Sorting in descending order

In [43]:
sorted_homelessness = homelessness.sort_values("individuals", ascending = False)
sorted_homelessness.head()

                region       state  individuals  family_members  state_pop
4              Pacific  California     109008.0         20964.0   39461588
32        Mid-Atlantic    New York      39827.0         52070.0   19530351
9       South Atlantic     Florida      21443.0          9587.0   21244317
43  West South Central       Texas      19199.0          6111.0   28628666
47             Pacific  Washington      16424.0          5880.0    7523869

Sorting by 2 or more columns

In [44]:
sorted_homelessness = homelessness.sort_values(
    ["region", "family_members"],
    ascending = [True, False]
)

sorted_homelessness.head()

                region      state  individuals  family_members  state_pop
13  East North Central   Illinois       6752.0          3891.0   12723071
35  East North Central       Ohio       6929.0          3320.0   11676341
22  East North Central   Michigan       5209.0          3142.0    9984072
49  East North Central  Wisconsin       2740.0          2167.0    5807406
14  East North Central    Indiana       3776.0          1482.0    6695497

### Subsetting columns

The single square brackets can be used to select the columns that are needed. A single column or a list of columns can be passed to the square brackets

In [45]:
individuals = homelessness["individuals"]
individuals.head()

0      2570.0
1      1434.0
2      7259.0
3      2280.0
4    109008.0
Name: individuals, dtype: float64

In [46]:
state_fam = homelessness[["state", "family_members"]]
state_fam.head()

        state  family_members
0     Alabama           864.0
1      Alaska           582.0
2     Arizona          2606.0
3    Arkansas           432.0
4  California         20964.0

Note that when passing a single string to the square brackets instead of a list, it will return a pandas Series, not a DataFrame. It's a bit different class

### Subsetting rows

The square brackets can also be used to subset rows. The only difference is that you'll need to pass a Series of booleans that match the amount of rows, and the method will return all the rows that are mapped to `True` on the Series.

In [47]:
# Filter for rows where individuals is greater than 10000
ind_gt_10k = homelessness[homelessness["individuals"] > 10000]

# See the result
ind_gt_10k

                region       state  individuals  family_members  state_pop
4              Pacific  California     109008.0         20964.0   39461588
9       South Atlantic     Florida      21443.0          9587.0   21244317
32        Mid-Atlantic    New York      39827.0         52070.0   19530351
37             Pacific      Oregon      11139.0          3337.0    4181886
43  West South Central       Texas      19199.0          6111.0   28628666
47             Pacific  Washington      16424.0          5880.0    7523869

Concatenating multiple conditions

In [48]:
# Filter for rows where family_members are less than 1000 AND region is Pacific
fam_lt_1k_pac = homelessness[(homelessness["family_members"] < 1000) & (homelessness["region"] == "Pacific")]

# See the result
fam_lt_1k_pac

    region   state  individuals  family_members  state_pop
1  Pacific  Alaska       1434.0           582.0     735139

In [49]:
# Filter for rows where family_members are less than 1000 OR region is Pacific
fam_lt_1k_pac = homelessness[(homelessness["family_members"] < 1000) | (homelessness["region"] == "Pacific")]

# See the result
fam_lt_1k_pac.head()

               region       state  individuals  family_members  state_pop
0  East South Central     Alabama       2570.0           864.0    4887681
1             Pacific      Alaska       1434.0           582.0     735139
3  West South Central    Arkansas       2280.0           432.0    3009733
4             Pacific  California     109008.0         20964.0   39461588
7      South Atlantic    Delaware        708.0           374.0     965479

Rows can also be subset by categorical variables, like this

In [50]:
# Subset for rows in South Atlantic or Mid-Atlantic regions
south_mid_atlantic = homelessness[homelessness["region"].isin(["South Atlantic", "Mid-Atlantic"])]

# See the result
south_mid_atlantic

,region,state,individuals,family_members,state_pop
7,South Atlantic,Delaware,708.0,374.0,965479
8,South Atlantic,District of Columbia,3770.0,3134.0,701547
9,South Atlantic,Florida,21443.0,9587.0,21244317
10,South Atlantic,Georgia,6943.0,2556.0,10511131
20,South Atlantic,Maryland,4914.0,2230.0,6035802
30,Mid-Atlantic,New Jersey,6048.0,3350.0,8886025
32,Mid-Atlantic,New York,39827.0,52070.0,19530351
33,South Atlantic,North Carolina,6451.0,2817.0,10381615
38,Mid-Atlantic,Pennsylvania,8163.0,5349.0,12800922
40,South Atlantic,South Carolina,3082.0,851.0,5084156
46,South Atlantic,Virginia,3928.0,2047.0,8501286
48,South Atlantic,West Virginia,1021.0,222.0,1804291

### Adding new columns

The assignment operator (`=`) can be used to create a new column or modifying an existing one

In [51]:
# Add total col as sum of individuals and family_members
homelessness["total"] = homelessness["individuals"] + homelessness["family_members"]

# Add p_individuals col as proportion of total that are individuals
homelessness["p_individuals"] = homelessness["individuals"] / homelessness["total"]

# See the result
homelessness.head()

,region,state,individuals,family_members,state_pop,total,p_individuals
0,East South Central,Alabama,2570.0,864.0,4887681,3434.0,0.748398
1,Pacific,Alaska,1434.0,582.0,735139,2016.0,0.711310
2,Mountain,Arizona,7259.0,2606.0,7158024,9865.0,0.735834
3,West South Central,Arkansas,2280.0,432.0,3009733,2712.0,0.840708
4,Pacific,California,109008.0,20964.0,39461588,129972.0,0.838704

## Agreggating Data

### Summary Statistics

pandas provides some helpers to calculate common summary statistics, such as `.mean()` and `.median()`

In [52]:
# Print the mean of individuals
homelessness["individuals"].mean()

7225.78431372549

In [53]:
# Print the median of individuals
homelessness["individuals"].median()

3082.0

In [54]:
# Print the maximum amount of individuals
homelessness["individuals"].max()

109008.0

In [55]:
# Print the minimum amount of individuals
homelessness["individuals"].min()

434.0

Pandas also provides the `.agg` method, which can receive a callback function or a list or callbacks and passes the specified column or columns and return the result of the callback

In [56]:
# Import NumPy and create custom IQR function
import numpy as np

def iqr(column):
    return column.quantile(0.75) - column.quantile(0.25)

# Print IQR and median of individuals and state_pop
homelessness[["individuals", "state_pop"]].agg([iqr, np.median])

        individuals  state_pop
iqr          5335.0  5563533.0
median       3082.0  4461153.0

### Cumulative Stats

`.cumsum()`, `.cummax()` and `.cummin()` are available to cumulatively operate on a column. This results in a new Series that can be stored in a new column of the DataFrame.

In [57]:
homelessness = homelessness.sort_values("state_pop")
homelessness["cum_state_pop"] = homelessness["state_pop"].cumsum()

homelessness.head()

,region,state,individuals,family_members,state_pop,total,p_individuals,cum_state_pop
50,Mountain,Wyoming,434.0,205.0,577601,639.0,0.679186,577601
45,New England,Vermont,780.0,511.0,624358,1291.0,0.604183,1201959
8,South Atlantic,District of Columbia,3770.0,3134.0,701547,6904.0,0.546060,1903506
1,Pacific,Alaska,1434.0,582.0,735139,2016.0,0.711310,2638645
34,West North Central,North Dakota,467.0,75.0,758080,542.0,0.861624,3396725

### Drop duplicates

In [63]:
# Dedupe the region column
homelessness_regions = homelessness.drop_duplicates("region")
homelessness_regions.head()

,region,state,individuals,family_members,state_pop,total,p_individuals,cum_state_pop
50,Mountain,Wyoming,434.0,205.0,577601,639.0,0.679186,577601
45,New England,Vermont,780.0,511.0,624358,1291.0,0.604183,1201959
8,South Atlantic,District of Columbia,3770.0,3134.0,701547,6904.0,0.546060,1903506
1,Pacific,Alaska,1434.0,582.0,735139,2016.0,0.711310,2638645
34,West North Central,North Dakota,467.0,75.0,758080,542.0,0.861624,3396725

### Count categorical values

In [70]:
# Dedupe region/state rows
homelessness_region_states = homelessness.drop_duplicates(["region", "state"])

# Number of states in each region
homelessness_region_states["region"].value_counts()

South Atlantic        9
Mountain              8
West North Central    7
New England           6
Pacific               5
East North Central    5
East South Central    4
West South Central    4
Mid-Atlantic          3
Name: region, dtype: int64

In [71]:
# Number of states in each region, normalized
homelessness_region_states["region"].value_counts(normalize = True)

South Atlantic        0.176471
Mountain              0.156863
West North Central    0.137255
New England           0.117647
Pacific               0.098039
East North Central    0.098039
East South Central    0.078431
West South Central    0.078431
Mid-Atlantic          0.058824
Name: region, dtype: float64